In [28]:
import duckdb
import pandas as pd

duckdb.sql("""
    CREATE OR REPLACE TABLE orders AS 
    SELECT 
        "Customer ID" AS customer_id,
        "Customer Status" AS customer_status,
        "Order ID" AS order_id,
        "Product ID" AS product_id,
        "Cost Price Per Unit" AS cost_price_per_unit,
        "Total Retail Price for This Order" AS total_retail_price,
        "Quantity Ordered" AS quantity_ordered,
        "Date Order was placed" AS order_date,
        "Delivery Date" AS delivery_date
    FROM read_csv_auto('orders.csv');
""")

duckdb.sql("""
    CREATE OR REPLACE TABLE product_supplier AS 
    SELECT 
        "Product ID" AS product_id,
        "Product Category" AS product_category,
        "Supplier Name" AS supplier_name,
        "Product Name" AS product_name,
        "Product Line" AS product_line,
        "Product Group" AS product_group,
        "Supplier Country" AS supplier_country
    FROM read_csv_auto('product-supplier.csv');
""")

In [29]:
duckdb.sql("SELECT * FROM orders LIMIT 5;").df()

,customer_id,customer_status,order_id,product_id,cost_price_per_unit,total_retail_price,quantity_ordered,order_date,delivery_date
0,579,Silver,123002578,220101400106,20.70,92.6,2,01-Jan-17,07-Jan-17
1,7574,SILVER,123004074,210201000009,9.95,21.7,1,01-Jan-17,05-Jan-17
2,28861,Gold,123000871,230100500068,0.80,1.7,1,01-Jan-17,04-Jan-17
3,43796,Gold,123002851,220100100633,24.05,47.9,1,01-Jan-17,06-Jan-17
4,54673,Gold,123003607,220200200043,18.30,36.9,1,01-Jan-17,04-Jan-17

In [30]:
duckdb.sql("SELECT * FROM product_supplier LIMIT 5;").df()

,product_id,product_category,supplier_name,product_name,product_line,product_group,supplier_country
0,210100100001,Children Outdoors,Scandinavian Clothing A/S,Boy's and Girl's Ski Pants with Braces,Children,"Outdoor things, Kids",NO
1,210100100002,Children Outdoors,Luna sastreria S.A.,Children's Jacket,Children,"Outdoor things, Kids",ES
2,210100100003,Children Outdoors,Scandinavian Clothing A/S,Children's Jacket Sidney,Children,"Outdoor things, Kids",NO
3,210100100004,Children Outdoors,Scandinavian Clothing A/S,Children's Rain Set,Children,"Outdoor things, Kids",NO
4,210100100005,Children Outdoors,Scandinavian Clothing A/S,Children's Rain Suit,Children,"Outdoor things, Kids",NO

Query : 1
Retrieve all customer records
Extract the full dataset of customers without any filters or limitations.

In [31]:
duckdb.sql("""
SELECT DISTINCT customer_id, customer_status
FROM orders
""").df()

        customer_id customer_status
0             65471            Gold
1             78667            Gold
2               827          Silver
3             46162          Silver
4             87352            Gold
...             ...             ...
111636        20666            Gold
111637         4018          Silver
111638        11229          Silver
111639        18877        Platinum
111640        20846            GOLD

[111641 rows x 2 columns]

Query : 2
Select customers from a specified location
Identify and isolate customers based on their geographic location or city.

In [32]:
duckdb.sql("""
SELECT DISTINCT o.customer_id, p.supplier_country
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
WHERE p.supplier_country = 'SE'
""").df()

      customer_id supplier_country
0           45770               SE
1            2316               SE
2           50225               SE
3           47890               SE
4           35536               SE
...           ...              ...
3862        73805               SE
3863           45               SE
3864        32902               SE
3865        81631               SE
3866        62124               SE

[3867 rows x 2 columns]

Query : 3
Extract essential product details
Retrieve only product name, category, and price for a simplified product overview.

In [33]:
duckdb.sql("""
SELECT 
    p.product_id,
    p.product_name,
    p.product_category,
    o.cost_price_per_unit,
    o.total_retail_price
FROM product_supplier p
LEFT JOIN orders o 
    ON p.product_id = o.product_id;

""").df()

,product_id,product_name,product_category,cost_price_per_unit,total_retail_price
0,230100100012,Jacket Talkeetna,Outdoors,86.10,376.4
1,240700200021,Helmet XL,Team Sports,10.55,39.2
2,240100100463,Sparkle Spray Orange,Assorted Sports Articles,6.00,14.6
3,240500200088,Maxrun Long-sleeved T-Shirt,Running - Jogging,18.90,79.4
4,220100100154,Big Guy Men's Full Zip Micro Fibre Jacket,Clothes,39.50,157.6
...,...,...,...,...,...
187388,240600100205,Towel 70x120,Swim Sports,NaN,NaN
187389,240800100024,4men Men's Exvert Pants,Winter Sports,NaN,NaN
187390,240800200011,Black PGO,Winter Sports,NaN,NaN
187391,240800200039,Coolman Pro/Extrem Pro 04 Red,Winter Sports,NaN,NaN
187392,240800200050,Original Eco Singl.99 Black,Winter Sports,NaN,NaN

Query : 4
List products sorted by price, highest first
Show the product catalog with the most expensive items at the top.

In [34]:
duckdb.sql("""
SELECT p.product_name, MAX(o.total_retail_price) AS max_price
FROM product_supplier p
JOIN orders o ON p.product_id = o.product_id
GROUP BY p.product_name
ORDER BY max_price DESC
""").df()

                  product_name  max_price
0       Top-form 325 Treadmill    6382.00
1     Fit4you Ski Jacket Astro    3740.00
2           Letour Trimag Bike    3708.60
3             Family Holiday 4    3599.40
4            Letour Heart Bike    3199.20
...                        ...        ...
3119                 Long Life       4.80
3120                 Universal       3.80
3121    Toe Brake Block, Black       3.10
3122                    Yellow       2.50
3123    Nylon with Pin, Medium       1.98

[3124 rows x 2 columns]

Query : 5
Show orders combined with respective customer details
Join orders with their corresponding customer information.

In [35]:
duckdb.sql("""
SELECT o.order_id, o.customer_id, o.product_id, o.quantity_ordered, o.total_retail_price, o.order_date,
       p.product_name, p.product_category
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
""").df()

,order_id,customer_id,product_id,quantity_ordered,total_retail_price,order_date,product_name,product_category
0,123952566,35967,230100100012,2,376.4,16-Jun-20,Jacket Talkeetna,Outdoors
1,123955644,37582,240700200021,2,39.2,16-Jun-20,Helmet XL,Team Sports
2,123951077,37734,240100100463,1,14.6,16-Jun-20,Sparkle Spray Orange,Assorted Sports Articles
3,123955655,38047,240500200088,2,79.4,16-Jun-20,Maxrun Long-sleeved T-Shirt,Running - Jogging
4,123959163,39347,220100100154,2,157.6,16-Jun-20,Big Guy Men's Full Zip Micro Fibre Jacket,Clothes
...,...,...,...,...,...,...,...,...
185008,123955599,34659,210200500015,3,53.4,16-Jun-20,Teen Lifa Ski Undershirt,Children Sports
185009,123959057,35243,230100600026,2,237.2,16-Jun-20,"Expedition 20,Large,Right,Forestgreen",Outdoors
185010,123951073,35403,210200300051,1,25.7,16-Jun-20,Tony's Core Mini Bag,Children Sports
185011,123959073,35864,230100600022,5,420.5,16-Jun-20,"Expedition10,Medium,Right,Blue Ribbon",Outdoors
185012,123952569,35967,240300300067,1,69.4,16-Jun-20,Top Men's Micro Fleece w/Small Zipper,Indoor Sports

Query : 6
Calculate total quantity sold for each product
Sum all quantities ordered for every product.

In [36]:
duckdb.sql("""
SELECT p.product_name, SUM(o.quantity_ordered) AS total_quantity_sold
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
GROUP BY p.product_name
""").df()

                             product_name  total_quantity_sold
0                     Tony's Cap w/Swoosh                 63.0
1            Dubby Low Men's Street Shoes                258.0
2                                  Ladies                 98.0
3                           Soccer Jr.Cap                 32.0
4           Big Guy Men's T-Shirt Dri Fit                123.0
...                                   ...                  ...
3119                          Eliza Dress                  3.0
3120   Clearview Sports Glasses Berry Jam                  6.0
3121                        Auto Autozone                  5.0
3122                 Top Bat Concav 5-Ply                  2.0
3123  Rollerskate Roller Skates W.Gretzky                  1.0

[3124 rows x 2 columns]

Query : 7
Compute total revenue generated by each product
Aggregate sales revenue per product.

In [37]:
duckdb.sql("""
SELECT p.product_name, SUM(o.total_retail_price) AS total_revenue
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
GROUP BY p.product_name
""").df()

                                 product_name  total_revenue
0         Woman's Clima Fit Ultra Lite Jacket       10721.40
1                                   Pants Fun        7481.80
2                       Profleece with Zipper       14182.50
3       Expedition10,Medium,Right,Blue Ribbon       87716.30
4                      Sunfit Madly Swim Suit       11494.20
...                                       ...            ...
3119          Soft Nimbus Men's Running Shoes        1422.28
3120            Breaker Boucle Cap with Flaps         294.00
3121  Trooper Ii Dmx-2x Women's Walking Shoes         230.20
3122     Grandslam Hyper Hammer 2.3 Ph Tennis         302.30
3123         Prosoccer Away Children's Shorts          42.60

[3124 rows x 2 columns]

Query : 8
Identify products that achieved revenue beyond a certain limit
Filter and list products that generated substantial revenue.

In [38]:
duckdb.sql("""
SELECT p.product_name, SUM(o.total_retail_price) AS total_revenue
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
GROUP BY p.product_name
HAVING SUM(o.total_retail_price) > 50000
""").df()

                                     product_name  total_revenue
0                    4men Men's Polar Down Jacket        66488.5
1           Expedition 20,Large,Right,Forestgreen        62383.6
2                          Tipee Twin Blue/Orange        57994.3
3               Tent Summer 195 Twin Sleeping Bag        76987.2
4                Perfect Fit Men's  Roller Skates        97905.0
..                                            ...            ...
58                              Lucky Voss Jacket        63790.5
59        Proskater Coyote Off Road Roller Skates        77110.0
60                   Jacket with Removable Fleece        90253.8
61  Outback Sleeping Bag, Large,Right, Blue/Black        54958.5
62              Crew Fs Titanium Mw  Driver 10.5g        57053.4

[63 rows x 2 columns]

Query : 9
Create a ranked list of customers based on spending
Order customers from highest to lowest total purchase amount.

In [39]:
duckdb.sql("""
SELECT customer_id, SUM(total_retail_price) AS total_spent,
       RANK() OVER (ORDER BY SUM(total_retail_price) DESC) AS rank
FROM orders
GROUP BY customer_id
""").df()

       customer_id  total_spent   rank
0             7766     6826.300      1
1            31519     6585.800      2
2            77062     6569.600      3
3            89591     6432.500      4
4            54290     6382.000      5
...            ...          ...    ...
56022        43765        1.300  56022
56023        52859        1.300  56022
56024         3985        1.300  56022
56025        87416        0.625  56026
56026        79868        0.625  56026

[56027 rows x 3 columns]

Query : 10
Generate monthly revenue summaries segmented by product category
Show how revenue varies month-wise for each product category.

In [40]:
duckdb.sql("""
SELECT strftime('%Y-%m', strptime(order_date, '%d-%b-%y')) AS month,
       p.product_category,
       SUM(o.total_retail_price) AS monthly_revenue
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
GROUP BY month, p.product_category
ORDER BY month, p.product_category;
""").df()

       month          product_category  monthly_revenue
0    2017-01  Assorted Sports Articles        41594.675
1    2017-01           Children Sports         9340.700
2    2017-01                   Clothes        42914.950
3    2017-01                      Golf        13128.800
4    2017-01             Indoor Sports        15421.000
..       ...                       ...              ...
715  2021-12         Running - Jogging        31874.080
716  2021-12                     Shoes       156687.710
717  2021-12               Swim Sports         4970.800
718  2021-12               Team Sports        23348.380
719  2021-12             Winter Sports        92626.955

[720 rows x 3 columns]

Query : 11
Find customers whose spending is above the average customer’s spend
Determine which customers spend more than the overall average.

In [41]:
duckdb.sql("""
WITH customer_total AS (
    SELECT customer_id, SUM(total_retail_price) AS total_spent
    FROM orders
    GROUP BY customer_id
),
average_spend AS (
    SELECT AVG(total_spent) AS avg_spent
    FROM customer_total
)
SELECT customer_id, total_spent
FROM customer_total
WHERE total_spent > (SELECT avg_spent FROM average_spend)
""").df()

       customer_id  total_spent
0            64570       504.79
1            65471      1320.50
2            78633      1345.00
3            90860      1463.64
4            19546      2208.80
...            ...          ...
20033        40392       495.00
20034        43366       502.80
20035        18327       720.00
20036        32692       630.40
20037         9812      1175.60

[20038 rows x 2 columns]

Query : 12
Assign customers into spending brackets (High, Medium, Low)
Categorize customers based on total spend.

In [42]:
duckdb.sql("""
WITH customer_total AS (
    SELECT customer_id, SUM(total_retail_price) AS total_spent
    FROM orders
    GROUP BY customer_id
)
SELECT customer_id, total_spent,
       CASE 
           WHEN total_spent >= 50000 THEN 'High'
           WHEN total_spent >= 20000 THEN 'Medium'
           ELSE 'Low'
       END AS spending_bracket
FROM customer_total
""").df()

       customer_id  total_spent spending_bracket
0            37582        474.6              Low
1            37734       1309.4              Low
2            56358        346.2              Low
3            63858         18.1              Low
4            70339       1280.2              Low
...            ...          ...              ...
56022        49828         12.4              Low
56023        73195        336.8              Low
56024        76472         99.0              Low
56025        91913        191.4              Low
56026        35864        420.5              Low

[56027 rows x 3 columns]

Query : 13
Identify customers who made multiple purchases over time
Spot repeat buyers and analyze purchase frequency

In [43]:
duckdb.sql("""
SELECT customer_id, COUNT(DISTINCT order_id) AS num_orders
FROM orders
GROUP BY customer_id
HAVING COUNT(DISTINCT order_id) > 1
""").df()

       customer_id  num_orders
0            86154           4
1            65311           7
2            79826           6
3            14926          15
4            31831           7
...            ...         ...
41014        30125           2
41015        60928           2
41016        21375           2
41017        15637           2
41018          719           2

[41019 rows x 2 columns]

Query : 14
Analyze customer retention by grouping customers based on their first purchase month
Track how many customers make repeat purchases in later months.

In [44]:
duckdb.sql("""
WITH first_purchase AS (
    SELECT customer_id, MIN(strftime('%Y-%m', strptime(order_date, '%d-%b-%y'))) AS first_month
    FROM orders
    GROUP BY customer_id
)
SELECT f.first_month, COUNT(DISTINCT o.customer_id) AS repeat_customers
FROM orders o
JOIN first_purchase f ON o.customer_id = f.customer_id
WHERE strftime('%Y-%m', strptime(o.order_date, '%d-%b-%y')) > f.first_month
GROUP BY f.first_month
""").df()

   first_month  repeat_customers
0      2019-10               326
1      2019-03               851
2      2017-03              1628
3      2018-04              1273
4      2018-03              1147
5      2017-08              1254
6      2017-11               913
7      2019-11               265
8      2019-04               886
9      2018-10               564
10     2021-04               232
11     2021-08               115
12     2017-02              1581
13     2017-12               938
14     2019-09               328
15     2017-05              1641
16     2020-10               143
17     2020-05               375
18     2019-01              1161
19     2018-06              1049
20     2021-11                26
21     2017-10              1022
22     2019-05               762
23     2019-12               287
24     2018-07               910
25     2019-07               582
26     2020-04               415
27     2017-09               857
28     2020-12                98
29     2020-03               435
30     2020-06               281
31     2021-03               245
32     2021-05               220
33     2021-10                45
34     2020-02               383
35     2018-05              1215
36     2017-01              2093
37     2018-12               585
38     2019-02               766
39     2018-08               848
40     2018-11               578
41     2017-07              1425
42     2019-06               607
43     2018-09               527
44     2020-01               519
45     2019-08               459
46     2021-02               251
47     2018-02              1220
48     2017-06              1412
49     2020-08               220
50     2020-11               129
51     2017-04              1724
52     2018-01              1623
53     2020-07               253
54     2021-09                58
55     2020-09               127
56     2021-01               350
57     2021-06               155
58     2021-07               136

Query : 15
Detect product pairs that are frequently bought together
Identify bundles or commonly purchased combinations.

In [45]:
duckdb.sql("""
SELECT o1.product_id AS product_1, o2.product_id AS product_2, COUNT(*) AS times_bought_together
FROM orders o1
JOIN orders o2 ON o1.order_id = o2.order_id AND o1.product_id < o2.product_id
GROUP BY o1.product_id, o2.product_id
ORDER BY times_bought_together DESC
LIMIT 20
""").df()

Empty DataFrame
Columns: [product_1, product_2, times_bought_together]
Index: []

Query : 16
Calculate and interpret moving averages of daily sales data 
Smooth sales trends using a rolling window.

In [46]:
duckdb.sql("""
SELECT strptime(order_date, '%d-%b-%y') AS order_date_parsed,
       SUM(total_retail_price) AS daily_sales,
       AVG(SUM(total_retail_price)) OVER (ORDER BY strptime(order_date, '%d-%b-%y') ROWS BETWEEN 6 PRECEDING AND CURRENT ROW) AS moving_avg_7days
FROM orders
GROUP BY order_date_parsed
ORDER BY order_date_parsed
""").df()

     order_date_parsed  daily_sales  moving_avg_7days
0           2017-01-01      225.500        225.500000
1           2017-01-02    10476.300       5350.900000
2           2017-01-03     8683.200       6461.666667
3           2017-01-04     3434.190       5704.797500
4           2017-01-05     9129.800       6389.798000
...                ...          ...               ...
1821        2021-12-27    34508.340      26907.890000
1822        2021-12-28    37662.285      27045.540000
1823        2021-12-29    13634.500      25813.540000
1824        2021-12-30    34466.430      26438.295714
1825        2021-12-31    20265.965      25062.710000

[1826 rows x 3 columns]

Query : 17
Produce monthly product sales rankings within each category, including ties
Rank products by sales for each category and month.

In [47]:
duckdb.sql("""
SELECT strftime('%Y-%m', strptime(order_date, '%d-%b-%y')) AS month,
       p.product_category,
       p.product_name,
       SUM(o.quantity_ordered) AS total_quantity,
       RANK() OVER (PARTITION BY strftime('%Y-%m', strptime(order_date, '%d-%b-%y')), p.product_category
                    ORDER BY SUM(o.quantity_ordered) DESC) AS rank
FROM orders o
JOIN product_supplier p ON o.product_id = p.product_id
GROUP BY month, p.product_category, p.product_name
ORDER BY month, p.product_category, rank
""").df()

,month,product_category,product_name,total_quantity,rank
0,2017-01,Assorted Sports Articles,Bulls Eye Stuart/Tungsten 24 Gram,17.0,1
1,2017-01,Assorted Sports Articles,Aim4it 16 Gram Softtip Pil,14.0,2
2,2017-01,Assorted Sports Articles,Aim4it 18 Gram Softtip Pil,10.0,3
3,2017-01,Assorted Sports Articles,Aim4it 80% Tungsten 21 Gram,7.0,4
4,2017-01,Assorted Sports Articles,Bulls Eye 15 Gram 80% Tungsten Soft,7.0,4
...,...,...,...,...,...
93082,2021-12,Winter Sports,Truls Jacket,3.0,44
93083,2021-12,Winter Sports,Fit4you Ski Jacket Astro,3.0,44
93084,2021-12,Winter Sports,Women's Ski Jacket Ventilation Air,3.0,44
93085,2021-12,Winter Sports,"Riffle Pmt,Bone",3.0,44
93086,2021-12,Winter Sports,Hot Duck Men's Ski Jacket Samourai,3.0,44